presorg.org
#+TITLE:     Slide export template
#+AUTHOR:    Robert Syme
#+EMAIL:     rob.syme@gmail.com
#+DATE:      2012-10-08 Mon
#+DESCRIPTION: A simple orgmode file for testing slide stylesheet
#+KEYWORDS: css emacs orgmode dart
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:2 \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+STYLE: <link href='http://fonts.googleapis.com/css?family=Lora:400,700' rel='stylesheet' type='text/css'><link rel="stylesheet" type="text/css" href="css/slides.css" /><link rel="stylesheet" type="text/css" href="css/src-styles.css" /><script type="application/javascript" src="web/presorg.dart.js"></script><script type="application/dart" src="web/presorg.dart"></script><script src="http://dart.googlecode.com/svn/branches/bleeding_edge/dart/client/dart.js"></script>

* Introduction
** Speaker Background
   This is my background. Skip to the end for [[*Conclusions][Conclusions]].
* Methods
** Javascript
   This might be a little tricky, as I don't really know much javascript.
** CSS
   This should be pretty easy
* Results
** Slides with code
   Here is some ruby
   
   #+BEGIN_SRC ruby -n -r :exports both :results output
     class Cat
       def talk                     #(ref:method-definition)
         puts "Meow"
       end
     end
     
     mittens = Cat.new
     mittens.talk
   #+END_SRC

   #+RESULTS:
   : Meow

   We might even be able to do some [[(method-definition)][code highlighting]].

** Internal links
   It would be good if we could link to other slides like:
   
   [[*Introduction][Introduction]]
   
   That should be easy enough
** Bullet points
   
   Bullets should be
   - easy to insert
   - not too ugly
     
** Tables

   |            | Calculations | Text |
   | Tables     | ✔            | ✔    |
   | Lists      | ✘            | ✔    |
   | Paragraphs | ✘            | ✔    |

** Centered content
   :PROPERTIES:
   :HTML_CONTAINER_CLASS: centered
   :END:

   Have come nice symmetric content.
*** HEADLINE

    This appears underneath the headline.

** Alerts
   :PROPERTIES:
   :HTML_CONTAINER_CLASS: alert centered
   :END:

   This should have a red background.
   
** Soothing greens
   :PROPERTIES:
   :HTML_CONTAINER_CLASS: soothe centered
   :END:
   So very calming.

** Have some code
   :PROPERTIES:
   :HTML_CONTAINER_CLASS: soothe centered
   :END:
   #+BEGIN_SRC dart
     bool testFunc() {
       return true;
     }
   #+END_SRC
* Conclusions
** Wrap up
   
   Concluding remarks go here
** Thank you
   
   A list of co-authors and contributing peers.
   
   
   #  LocalWords:  javascript
