presorg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Slide export template</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Slide export template"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-08 Mon"/>
<meta name="author" content="Robert Syme"/>
<meta name="description" content="A simple orgmode file for testing slide stylesheet"/>
<meta name="keywords" content="css emacs orgmode dart"/>
<link href='http://fonts.googleapis.com/css?family=Lora:400,700' rel='stylesheet' type='text/css'><link rel="stylesheet" type="text/css" href="css/slides.css" /><link rel="stylesheet" type="text/css" href="css/src-styles.css" />
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Slide export template</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a>
<ul>
<li><a href="#sec-1-1">Speaker Background</a></li>
</ul>
</li>
<li><a href="#sec-2">Methods</a>
<ul>
<li><a href="#sec-2-1">Javascript</a></li>
<li><a href="#sec-2-2">CSS</a></li>
</ul>
</li>
<li><a href="#sec-3">Results</a>
<ul>
<li><a href="#sec-3-1">Slides with code</a></li>
<li><a href="#sec-3-2">Internal links</a></li>
<li><a href="#sec-3-3">Bullet points</a></li>
<li><a href="#sec-3-4">Tables</a></li>
<li><a href="#sec-3-5">Centered content</a></li>
<li><a href="#sec-3-6">Alerts</a></li>
<li><a href="#sec-3-7">Soothing greens</a></li>
<li><a href="#sec-3-8">Have some code</a></li>
</ul>
</li>
<li><a href="#sec-4">Conclusions</a>
<ul>
<li><a href="#sec-4-1">Wrap up</a></li>
<li><a href="#sec-4-2">Thank you</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Speaker Background</h3>
<div class="outline-text-3" id="text-1-1">

<p>   This is my background. Skip to the end for <a href="#sec-4">Conclusions</a>.
</p></div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Methods</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Javascript</h3>
<div class="outline-text-3" id="text-2-1">

<p>   This might be a little tricky, as I don't really know much javascript.
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">CSS</h3>
<div class="outline-text-3" id="text-2-2">

<p>   This should be pretty easy
</p></div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Results</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Slides with code</h3>
<div class="outline-text-3" id="text-3-1">

<p>   Here is some ruby
</p>



<pre class="src src-ruby"><span class="linenr">1:  </span><span class="org-keyword">class</span> <span class="org-type">Cat</span>
<span id="coderef-method-definition" class="coderef-off"><span class="linenr">2:  </span>  <span class="org-keyword">def</span> <span class="org-function-name">talk</span>                     <span class="org-comment-delimiter">#</span><span class="org-comment"></span></span>
<span class="linenr">3:  </span>    puts <span class="org-string">"Meow"</span>
<span class="linenr">4:  </span>  <span class="org-keyword">end</span>
<span class="linenr">5:  </span><span class="org-keyword">end</span>
<span class="linenr">6:  </span>
<span class="linenr">7:  </span>mittens = <span class="org-type">Cat</span>.new
<span class="linenr">8:  </span>mittens.talk
</pre>


<pre class="example">
Meow
</pre>


<p>
   We might even be able to do some <a href="#coderef-method-definition" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-method-definition');" onmouseout="CodeHighlightOff(this, 'coderef-method-definition');">code highlighting</a>.
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">Internal links</h3>
<div class="outline-text-3" id="text-3-2">

<p>   It would be good if we could link to other slides like:
</p>
<p>   
   <a href="#sec-1">Introduction</a>
</p>
<p>   
   That should be easy enough
</p></div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">Bullet points</h3>
<div class="outline-text-3" id="text-3-3">


<p>   
   Bullets should be
</p><ul>
<li>easy to insert
</li>
<li>not too ugly
</li>
</ul>


</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">Tables</h3>
<div class="outline-text-3" id="text-3-4">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left"></td><td class="left">Calculations</td><td class="left">Text</td></tr>
<tr><td class="left">Tables</td><td class="left">✔</td><td class="left">✔</td></tr>
<tr><td class="left">Lists</td><td class="left">✘</td><td class="left">✔</td></tr>
<tr><td class="left">Paragraphs</td><td class="left">✘</td><td class="left">✔</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3-5" class="outline-3 centered">
<h3 id="sec-3-5">Centered content</h3>
<div class="outline-text-3" id="text-3-5">


<p>
   Have come nice symmetric content.
</p>
</div>

<div id="outline-container-3-5-1" class="outline-4">
<h4 id="sec-3-5-1">HEADLINE</h4>
<div class="outline-text-4" id="text-3-5-1">


<p>
    This appears underneath the headline.
</p>
</div>
</div>

</div>

<div id="outline-container-3-6" class="outline-3 alert centered">
<h3 id="sec-3-6">Alerts</h3>
<div class="outline-text-3" id="text-3-6">


<p>
   This should have a red background.
</p>
</div>

</div>

<div id="outline-container-3-7" class="outline-3 soothe centered">
<h3 id="sec-3-7">Soothing greens</h3>
<div class="outline-text-3" id="text-3-7">

<p>   So very calming.
</p>
</div>

</div>

<div id="outline-container-3-8" class="outline-3 soothe centered">
<h3 id="sec-3-8">Have some code</h3>
<div class="outline-text-3" id="text-3-8">




<pre class="src src-dart"><span class="org-type">bool</span> <span class="org-function-name">testFunc</span>() {
  <span class="org-keyword">return</span> <span class="org-constant">true</span>;
}
</pre>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Conclusions</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">Wrap up</h3>
<div class="outline-text-3" id="text-4-1">


<p>   
   Concluding remarks go here
</p></div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">Thank you</h3>
<div class="outline-text-3" id="text-4-2">


<p>   
   A list of co-authors and contributing peers.
</p>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-08 Mon</p>
<p class="author">Author: Robert Syme</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.1 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
